# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders` from the file `Oders.csv` located in the `data` folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# your code here
orders=pd.read_csv("../data/Orders.csv")

In [3]:
orders.head(5)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [4]:
orders_country_amountspent = orders.groupby(['CustomerID','Country'],as_index=False)['amount_spent'].sum()
orders_country_amountspent

      CustomerID         Country  amount_spent
0          12346  United Kingdom      77183.60
1          12347         Iceland       4310.00
2          12348         Finland       1797.24
3          12349           Italy       1757.55
4          12350          Norway        334.40
...          ...             ...           ...
4342       18280  United Kingdom        180.60
4343       18281  United Kingdom         80.82
4344       18282  United Kingdom        178.05
4345       18283  United Kingdom       2094.88
4346       18287  United Kingdom       1837.28

[4347 rows x 3 columns]

In [7]:
quantile_95 = orders_country_amountspent['amount_spent'].quantile(0.95)
quantile_75 = orders_country_amountspent['amount_spent'].quantile(0.75)

In [11]:
def customer_type_func(amount):
    if amount >= quantile_95:
        return 'vip'
    elif (amount < quantile_95 ) & (amount > quantile_75):
        return 'prefered'

    
orders_country_amountspent['customer_type'] = orders_country_amountspent['amount_spent'].apply(customer_type_func)

orders_country_amountspent

      CustomerID         Country  amount_spent customer_type
0          12346  United Kingdom      77183.60           vip
1          12347         Iceland       4310.00      prefered
2          12348         Finland       1797.24      prefered
3          12349           Italy       1757.55      prefered
4          12350          Norway        334.40          None
...          ...             ...           ...           ...
4342       18280  United Kingdom        180.60          None
4343       18281  United Kingdom         80.82          None
4344       18282  United Kingdom        178.05          None
4345       18283  United Kingdom       2094.88      prefered
4346       18287  United Kingdom       1837.28      prefered

[4347 rows x 4 columns]

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

# Q2: How to identify which country has the most VIP Customers?

In [12]:
(orders_country_amountspent[orders_country_amountspent['customer_type']=='vip']).groupby('Country').count().sort_values(by='customer_type',ascending=False)

                 CustomerID  amount_spent  customer_type
Country
United Kingdom          178           178            178
Germany                  11            11             11
France                    9             9              9
Switzerland               3             3              3
Spain                     2             2              2
Portugal                  2             2              2
Japan                     2             2              2
EIRE                      2             2              2
Finland                   1             1              1
Channel Islands           1             1              1
Netherlands               1             1              1
Norway                    1             1              1
Singapore                 1             1              1
Denmark                   1             1              1
Sweden                    1             1              1
Cyprus                    1             1              1
Australia                 1             1              1

In [13]:
orders_country_amountspent.groupby(['customer_type','Country']).size()['vip'].sort_values(ascending=False)

Country
United Kingdom     178
Germany             11
France               9
Switzerland          3
EIRE                 2
Japan                2
Portugal             2
Spain                2
Norway               1
Netherlands          1
Singapore            1
Finland              1
Sweden               1
Denmark              1
Cyprus               1
Channel Islands      1
Australia            1
dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [14]:
orders_country_amountspent.groupby('customer_type')['Country'].describe()

              count unique             top freq
customer_type
prefered        869     25  United Kingdom  756
vip             218     17  United Kingdom  178